In [1]:
import numpy as np
import pandas as pd

In [3]:
a=[10,20,30,40,50]
n=np.array(a)
print(n)
s=pd.Series(a)
print(s)

[10 20 30 40 50]
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
b=pd.Series(a,index=('i','ii','iii','iv','v'))
print(b)

i      10
ii     20
iii    30
iv     40
v      50
dtype: int64

In [6]:
d={1:"sunday",2:"monday",3:"tuesday"}
s1=pd.Series(d)
print(s1)

1     sunday
2     monday
3    tuesday
dtype: object

In [7]:
print(type(s1))

<class 'pandas.core.series.Series'>

In [8]:
#series to list
ds = pd.Series([2, 4, 6, 8, 10])
print("Pandas Series and type")
print(ds)
print(type(ds))
print("Convert Pandas Series to Python list")
print(ds.tolist())#tolist() converts series to list
print(type(ds.tolist()))

Pandas Series and type
0     2
1     4
2     6
3     8
4    10
dtype: int64
<class 'pandas.core.series.Series'>
Convert Pandas Series to Python list
[2, 4, 6, 8, 10]
<class 'list'>

In [9]:
#arithmetic operation on series
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
ds = ds1 + ds2
print("Add two Series:")
print(ds)
print("Subtract two Series:")
ds = ds1 - ds2
print(ds)
print("Multiply two Series:")
ds = ds1 * ds2
print(ds)
print("Divide Series1 by Series2:")
ds = ds1 / ds2
print(ds)

Add two Series:
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtract two Series:
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiply two Series:
0     2
1    12
2    30
3    56
4    90
dtype: int64
Divide Series1 by Series2:
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [10]:
a=pd.Series([1,2,3,4,5,6,7,8])
print(a)
print(type(a))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64
<class 'pandas.core.series.Series'>

In [11]:
l=a.tolist()
print(l)
print(type(l))

[1, 2, 3, 4, 5, 6, 7, 8]
<class 'list'>

In [16]:
#convert datatype
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
print("Original Data Series:")
print(s1)
print("Change the said data type to numeric:")
s2 = pd.to_numeric(s1, errors='coerce')
print(s2)
print(type(s2))

Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Change the said data type to numeric:
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64
<class 'pandas.core.series.Series'>

In [18]:
print(s1.sort_values())

0       100
1       200
3    300.12
4       400
2    python
dtype: object

In [23]:
str1 = 'abcaaaaadefabcdeficd'
l=pd.Series(list(str1))
print(l.value_counts())

a    7
d    3
c    3
f    2
e    2
b    2
i    1
dtype: int64

In [24]:
s = pd.Series(data = [1,2,3,4,5,6,7,8,9,5,3])
print(s.mean())
print(s.std())

4.818181818181818
2.522624895547565

In [25]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])

In [27]:
n=pd.Series([500,'php'])
print(s1.append(n))

0       100
1       200
2    python
3    300.12
4       400
0       500
1       php
dtype: object

In [2]:
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 10])

In [3]:
print(ds1==ds2)
print(ds1>ds2)
print(ds2>ds1)
print(ds1<ds2)
print(ds2<ds1)

0    False
1    False
2    False
3    False
4     True
dtype: bool
0     True
1     True
2     True
3     True
4    False
dtype: bool
0    False
1    False
2    False
3    False
4    False
dtype: bool
0    False
1    False
2    False
3    False
4    False
dtype: bool
0     True
1     True
2     True
3     True
4    False
dtype: bool

In [4]:
#get the items of a given series not present in another given series
sr1 = pd.Series([1, 2, 3, 4, 5])
sr2 = pd.Series([2, 4, 6, 8, 10])
print("Original Series:")
print("sr1:")
print(sr1)
print("sr2:")
print(sr2)

Original Series:
sr1:
0    1
1    2
2    3
3    4
4    5
dtype: int64
sr2:
0     2
1     4
2     6
3     8
4    10
dtype: int64

In [9]:
print("\nItems of sr1  not present in sr2:")
r=sr1.isin(sr2)
print(r)

Items of sr1  not present in sr2:
0    False
1     True
2    False
3     True
4    False
dtype: bool

In [10]:
result = sr1[sr1.isin(sr2)]
print(result)

1    2
3    4
dtype: int64

In [12]:
print("\nItems of sr1 not present in sr2:")
r2=sr1[sr1.isin(sr2)]
print(r2)
result = sr1[~sr1.isin(sr2)]#tidle
print(result)

Items of sr1 not present in sr2:
1    2
3    4
dtype: int64
0    1
2    3
4    5
dtype: int64

In [22]:
sr1 = pd.Series([1, 2, 3, 4, 5])
position = np.argwhere(sr1==5)
print(position)

[[4]]

# DataFrame

In [23]:
data=[{'a':1,'b':2,'c':9},{'a':5,'b':10,'c':15}]
sr=pd.Series(data)
print(sr)
df=pd.DataFrame(data)
print(df)

0      {'a': 1, 'b': 2, 'c': 9}
1    {'a': 5, 'b': 10, 'c': 15}
dtype: object
   a   b   c
0  1   2   9
1  5  10  15

In [24]:
df=pd.DataFrame(data,index=['first','second'],columns=['a','c'])
print(df)

        a   c
first   1   9
second  5  15

In [26]:
df=pd.DataFrame({'product_id':[1,2,3,4],
                'product_name':["jeans","skirt","t-shirt","trouser"],
                'color':["blue","white","yellow","black"]})
print(df)

   product_id product_name   color
0           1        jeans    blue
1           2        skirt   white
2           3      t-shirt  yellow
3           4      trouser   black

In [28]:
df1=pd.DataFrame([[1,'sameer',78],[2,'rishi',90]],columns=['roll_no','name','marks'])
print(df1)

   roll_no    name  marks
0        1  sameer     78
1        2   rishi     90

In [30]:
df2 = pd.DataFrame([
  [1, 'San Diego', 100],
  [2, 'Los Angeles', 120],
  # Fill in rows 3 and 4
  [3,'San Francisco',90],
  [4,'Sacramento',115]
],
  columns=[
    #add column names here
    'Store ID','Location','Number of Employees'
  ])

print(df2)

   Store ID       Location  Number of Employees
0         1      San Diego                  100
1         2    Los Angeles                  120
2         3  San Francisco                   90
3         4     Sacramento                  115

In [31]:
df2.head(2)#first 5 rows

   Store ID     Location  Number of Employees
0         1    San Diego                  100
1         2  Los Angeles                  120

In [32]:
df2.info()#information regarding your data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
Store ID               4 non-null int64
Location               4 non-null object
Number of Employees    4 non-null int64
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [33]:
df2.tail(3)#last 5 rows of data

   Store ID       Location  Number of Employees
1         2    Los Angeles                  120
2         3  San Francisco                   90
3         4     Sacramento                  115

In [37]:
df2['Location']#dataframe['column_name']

0        San Diego
1      Los Angeles
2    San Francisco
3       Sacramento
Name: Location, dtype: object

In [38]:
df2['Number of Employees']

0    100
1    120
2     90
3    115
Name: Number of Employees, dtype: int64

In [36]:
df2.iloc[1]#to access row
#dataframe.iloc[row_index]

Store ID                         2
Location               Los Angeles
Number of Employees            120
Name: 1, dtype: object

In [39]:
df = pd.DataFrame([
  ['January', 100, 100, 23, 100],
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 'clinic_east',
           'clinic_north', 'clinic_south',
           'clinic_west'])

In [41]:
march = df.iloc[2]
print(march)

month           March
clinic_east        81
clinic_north       96
clinic_south       65
clinic_west        96
Name: 2, dtype: object

In [46]:
feb_june = df.iloc[1:]
print(feb_june)

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [49]:
jan_mar = df.iloc[:3]
print(jan_mar)

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96

In [55]:
#conditional selection
jan = df[df.month=='January']
print(jan)

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100

In [68]:
jan_may = df[(df.month=='January') & (df.clinic_north==100)]
print(jan_may)

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100

In [61]:
df2=df[(df.month=='April') | (df.clinic_north>100)]
print(df2)

   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
5   June          112           109            79          129

In [62]:
multiple = df[df.month.isin(['January','May','June'])]
print(multiple)

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
4      May           51            54            54          154
5     June          112           109            79          129

In [67]:
df3=multiple.reset_index(drop=True)
print(df3)

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
1      May           51            54            54          154
2     June          112           109            79          129

In [70]:
df= pd.read_csv("shoefly.csv")
print(df)

       id  first_name   last_name                         email     shoe_type  \
0   54791     Rebecca     Lindsay  RebeccaLindsay57@hotmail.com         clogs
1   53450       Emily       Joyce        EmilyJoyce25@gmail.com  ballet flats
2   91987       Joyce      Waller        Joyce.Waller@gmail.com       sandals
3   14437      Justin    Erickson   Justin.Erickson@outlook.com         clogs
4   79357      Andrew       Banks              AB4318@gmail.com         boots
5   52386       Julie       Marsh        JulieMarsh59@gmail.com       sandals
6   20487      Thomas      Jensen              TJ5470@gmail.com         clogs
7   76971      Janice       Hicks        Janice.Hicks@gmail.com         clogs
8   21586     Gabriel      Porter     GabrielPorter24@gmail.com         clogs
9   62083     Frances      Palmer     FrancesPalmer50@gmail.com        wedges
10  91629     Jessica        Hale       JessicaHale25@gmail.com         clogs
11  98602    Lawrence      Parker    LawrenceParker44@gmail.com        wedges
12  45832       Susan      Dennis       SusanDennis58@gmail.com  ballet flats
13  33862       Diane       Ochoa              DO2680@gmail.com       sandals
14  73431     Rebecca     Charles     Rebecca.Charles@gmail.com         boots
15  93889  Jacqueline       Crane            JC2072@hotmail.com        wedges
16  39888     Vincent  Stephenson            VS4753@outlook.com         boots
17  35961         Roy     Tillman        RoyTillman20@gmail.com         boots
18  24560      Thomas    Roberson     Thomas.Roberson@gmail.com        wedges
19  28559      Angela      Newton       ANewton1977@outlook.com        wedges

   shoe_material shoe_color  gender
0   faux-leather      black  female
1   faux-leather       navy  female
2         fabric      black    male
3   faux-leather        red    male
4        leather      brown    male
5         fabric      black  female
6         fabric       navy    male
7   faux-leather       navy  female
8        leather      brown    male
9        leather      white    male
10       leather        red  female
11        fabric      brown  female
12        fabric      white  female
13        fabric        red  female
14  faux-leather      white  female
15        fabric        red  female
16       leather      black    male
17       leather      white    male
18        fabric        red    male
19        fabric        red  female

In [71]:
df.head()

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color,gender
0,54791,Rebecca,Lindsay,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black,female
1,53450,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy,female
2,91987,Joyce,Waller,Joyce.Waller@gmail.com,sandals,fabric,black,male
3,14437,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red,male
4,79357,Andrew,Banks,AB4318@gmail.com,boots,leather,brown,male

In [72]:
df.tail()

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color,gender
15,93889,Jacqueline,Crane,JC2072@hotmail.com,wedges,fabric,red,female
16,39888,Vincent,Stephenson,VS4753@outlook.com,boots,leather,black,male
17,35961,Roy,Tillman,RoyTillman20@gmail.com,boots,leather,white,male
18,24560,Thomas,Roberson,Thomas.Roberson@gmail.com,wedges,fabric,red,male
19,28559,Angela,Newton,ANewton1977@outlook.com,wedges,fabric,red,female

In [73]:
df.shape

(20, 8)

In [74]:
df.size

160

In [75]:
df.ndim

2

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 8 columns):
id               20 non-null int64
first_name       20 non-null object
last_name        20 non-null object
email            20 non-null object
shoe_type        20 non-null object
shoe_material    20 non-null object
shoe_color       20 non-null object
gender           20 non-null object
dtypes: int64(1), object(7)
memory usage: 1.3+ KB

In [77]:
#Part 1: reading the csv
orders = pd.read_csv('shoefly.csv')

#Part 2: inspecting the first five lines of data
print(orders.head(5))

#Part 3: selecting the column 'email'
emails = orders.email
print(emails)

#Part 4: the Frances Palmer incident
frances_palmer = orders[(orders.first_name == 'Frances') & (orders.last_name == 'Palmer')]
print(frances_palmer)

#Part 5: Comfy feet means more time on the street
comfy_shoes = orders[orders.shoe_type.isin(['clogs', 'boots', 'ballet flats'])]
print(comfy_shoes)

      id first_name last_name                         email     shoe_type  \
0  54791    Rebecca   Lindsay  RebeccaLindsay57@hotmail.com         clogs
1  53450      Emily     Joyce        EmilyJoyce25@gmail.com  ballet flats
2  91987      Joyce    Waller        Joyce.Waller@gmail.com       sandals
3  14437     Justin  Erickson   Justin.Erickson@outlook.com         clogs
4  79357     Andrew     Banks              AB4318@gmail.com         boots

  shoe_material shoe_color  gender
0  faux-leather      black  female
1  faux-leather       navy  female
2        fabric      black    male
3  faux-leather        red    male
4       leather      brown    male
0     RebeccaLindsay57@hotmail.com
1           EmilyJoyce25@gmail.com
2           Joyce.Waller@gmail.com
3      Justin.Erickson@outlook.com
4                 AB4318@gmail.com
5           JulieMarsh59@gmail.com
6                 TJ5470@gmail.com
7           Janice.Hicks@gmail.com
8        GabrielPorter24@gmail.com
9        FrancesPalmer50@gmail.com
10         JessicaHale25@gmail.com
11      LawrenceParker44@gmail.com
12         SusanDennis58@gmail.com
13                DO2680@gmail.com
14       Rebecca.Charles@gmail.com
15              JC2072@hotmail.com
16              VS4753@outlook.com
17          RoyTillman20@gmail.com
18       Thomas.Roberson@gmail.com
19         ANewton1977@outlook.com
Name: email, dtype: object
      id first_name last_name                      email shoe_type  \
9  62083    Frances    Palmer  FrancesPalmer50@gmail.com    wedges

  shoe_material shoe_color gender
9       leather      white   male
       id first_name   last_name                         email     shoe_type  \
0   54791    Rebecca     Lindsay  RebeccaLindsay57@hotmail.com         clogs
1   53450      Emily       Joyce        EmilyJoyce25@gmail.com  ballet flats
3   14437     Justin    Erickson   Justin.Erickson@outlook.com         clogs
4   79357     Andrew       Banks              AB4318@gmail.com         boots
6   20487     Thomas      Jensen              TJ5470@gmail.com         clogs
7   76971     Janice       Hicks        Janice.Hicks@gmail.com         clogs
8   21586    Gabriel      Porter     GabrielPorter24@gmail.com         clogs
10  91629    Jessica        Hale       JessicaHale25@gmail.com         clogs
12  45832      Susan      Dennis       SusanDennis58@gmail.com  ballet flats
14  73431    Rebecca     Charles     Rebecca.Charles@gmail.com         boots
16  39888    Vincent  Stephenson            VS4753@outlook.com         boots
17  35961        Roy     Tillman        RoyTillman20@gmail.com         boots

   shoe_material shoe_color  gender
0   faux-leather      black  female
1   faux-leather       navy  female
3   faux-leather        red    male
4        leather      brown    male
6         fabric       navy    male
7   faux-leather       navy  female
8        leather      brown    male
10       leather        red  female
12        fabric      white  female
14  faux-leather      white  female
16       leather      black    male
17       leather      white    male

In [78]:
df=pd.DataFrame(np.random.randn(5,3),index=['a','c','e','f','h'],columns=['one','two','three'])

df=df.reindex(['a','b','c','d','e','f','g','h'])


print(df)
#not a number-NaN

        one       two     three
a -1.469375 -1.902144 -1.646910
b       NaN       NaN       NaN
c -1.013328 -0.161013 -0.659562
d       NaN       NaN       NaN
e  0.426992  1.271226  0.274428
f  0.999085 -1.129183 -0.404957
g       NaN       NaN       NaN
h -1.325067 -1.360315  1.257981

In [84]:
df['one'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [85]:
df['one'].isnull().sum()

3

In [80]:
print(df['one'].notnull())

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [86]:
print(df.dropna())
print(df)

        one       two     three
a -1.469375 -1.902144 -1.646910
c -1.013328 -0.161013 -0.659562
e  0.426992  1.271226  0.274428
f  0.999085 -1.129183 -0.404957
h -1.325067 -1.360315  1.257981
        one       two     three
a -1.469375 -1.902144 -1.646910
b       NaN       NaN       NaN
c -1.013328 -0.161013 -0.659562
d       NaN       NaN       NaN
e  0.426992  1.271226  0.274428
f  0.999085 -1.129183 -0.404957
g       NaN       NaN       NaN
h -1.325067 -1.360315  1.257981

In [88]:
print(df.loc['b'].isnull())

one      True
two      True
three    True
Name: b, dtype: bool

In [89]:
print(df.loc['c'].notnull())

one      True
two      True
three    True
Name: c, dtype: bool

In [83]:
print(df.fillna(0))

        one       two     three
a -1.469375 -1.902144 -1.646910
b  0.000000  0.000000  0.000000
c -1.013328 -0.161013 -0.659562
d  0.000000  0.000000  0.000000
e  0.426992  1.271226  0.274428
f  0.999085 -1.129183 -0.404957
g  0.000000  0.000000  0.000000
h -1.325067 -1.360315  1.257981

In [22]:
data={'company':['goog','goog','msft','msft','fb','fb'],
         'person':['vishal','akshay','satish','anuj','sekhar','sanjay'],
           'sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
print(df)

  company  person  sales
0    goog  vishal    200
1    goog  akshay    120
2    msft  satish    340
3    msft    anuj    124
4      fb  sekhar    243
5      fb  sanjay    350

In [23]:
print(df.groupby(['company']))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001DCAA1BE5C0>

In [24]:
print(df.groupby(['company'])['sales'].sum())

company
fb      593
goog    320
msft    464
Name: sales, dtype: int64

In [25]:
#find out mean(average) of sales by company
print(df.groupby(['company'])['sales'].mean())
print(df.groupby(['company'])['sales'].sum())
print(df.groupby(['company'])['sales'].std())
print(df.groupby(['company'])['sales'].min())
print(df.groupby(['company'])['sales'].max())

company
fb      296.5
goog    160.0
msft    232.0
Name: sales, dtype: float64
company
fb      593
goog    320
msft    464
Name: sales, dtype: int64
company
fb       75.660426
goog     56.568542
msft    152.735065
Name: sales, dtype: float64
company
fb      243
goog    120
msft    124
Name: sales, dtype: int64
company
fb      350
goog    200
msft    340
Name: sales, dtype: int64

In [29]:
df = pd.DataFrame([
  ['January', 100, 100, 23, 100],
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 'clinic_east',
           'clinic_north', 'clinic_south',
           'clinic_west'])

In [9]:
print(df)

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [16]:
df.at[0,'clinic_north']

100

In [17]:
df.at[5,'clinic_west']

129

In [ ]:
#to access row index df.iloc
#to access column df.columnname
#to access by both row and column then use df.at[rowindex,columnname]

In [30]:
p=df[(df.month =='January') & (df.clinic_south==23)]

In [31]:
p[['month','clinic_north']]

     month  clinic_north
0  January           100

In [33]:

ipl_data={'team':['riders','riders','devils','devils','kings','kings','kings','kings','riders','royals','royals','riders'],
          'rank':[1,2,2,3,3,4,1,1,2,4,1,2],
          'year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
             'points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df=pd.DataFrame(ipl_data)
print(df)
#select team,rank,point from ipl_data limit 3
#select* from ipl_data where year=2014
#print rank and year for rider
#select * from ipl_data where team=ridder and year=2014
#select * from ipl_data where team riders or year=2014

      team  rank  year  points
0   riders     1  2014     876
1   riders     2  2015     789
2   devils     2  2014     863
3   devils     3  2015     673
4    kings     3  2014     741
5    kings     4  2015     812
6    kings     1  2016     756
7    kings     1  2017     788
8   riders     2  2016     694
9   royals     4  2014     701
10  royals     1  2015     804
11  riders     2  2017     690

In [34]:
#select team,rank,point from ipl_data limit 3
print(df.head(2))
print(df[['team','rank','points']].head(3))

     team  rank  year  points
0  riders     1  2014     876
1  riders     2  2015     789
     team  rank  points
0  riders     1     876
1  riders     2     789
2  devils     2     863

In [39]:
#select* from ipl_data where year=2014
print(df[df.year==2014])

     team  rank  year  points
0  riders     1  2014     876
2  devils     2  2014     863
4   kings     3  2014     741
9  royals     4  2014     701

In [43]:
#print rank and year for rider
x=df[df.team =='riders']
print(x)
print(x[['rank','year']])

      team  rank  year  points
0   riders     1  2014     876
1   riders     2  2015     789
8   riders     2  2016     694
11  riders     2  2017     690
    rank  year
0      1  2014
1      2  2015
8      2  2016
11     2  2017

In [41]:
#select * from ipl_data where team=ridder and year=2014
print(df[(df.team =='riders')&(df.year ==2014)])

     team  rank  year  points
0  riders     1  2014     876

In [42]:
#select * from ipl_data where team riders or year=2014
print(df[(df.team =='riders')|(df.year ==2014)])

      team  rank  year  points
0   riders     1  2014     876
1   riders     2  2015     789
2   devils     2  2014     863
4    kings     3  2014     741
8   riders     2  2016     694
9   royals     4  2014     701
11  riders     2  2017     690

In [44]:
#variable = lambda list of arguments : expression(only one expression)
#it can take no of arguments but has only one expression

In [45]:
z=lambda a,b:a+b
print(z(2,3))

5

In [47]:
s=lambda a:a**2
print(s(5))

25

In [48]:
m=lambda x:x*40+20
print(m(50))

2020

In [49]:
strup = lambda s:s.upper()

strup("india")

'INDIA'

In [50]:
strl= lambda a:len(a)

strl("vishakhapattanam")

16

In [52]:
mylambda = lambda x: x[0]+x[-1]
print(mylambda('India is BEST'))

IT

In [54]:
first = lambda s:s.split()[0]
print(first("amruta chimote"))

amruta

In [56]:
#Create a lambda function get_last_name which takes a string with someone’s first and last name 
#(i.e., John Smith), and returns just the last name (i.e., Smith).
df = pd.read_csv('employees.csv')
print(df)

       id               name  hourly_wage  hours_worked
0   10310      Lauren Durham           19            43
1   18656      Grace Sellers           17            40
2   61254  Shirley Rasmussen           16            30
3   16886        Brian Rojas           18            47
4   89010    Samantha Mosley           11            38
5   87246       Louis Guzman           14            39
6   20578     Denise Mcclure           15            40
7   12869      James Raymond           15            32
8   53461       Noah Collier           18            35
9   14746    Donna Frederick           20            41
10  71127       Shirley Beck           14            32
11  92522    Christina Kelly            8            44
12  22447        Brian Noble           11            39
13  61654          Randy Key           16            38
14  16988      Diana Stewart           14            48
15  68619       Timothy Sosa           14            42
16  59949      Betty Skinner           11            48
17  81418      Janet Maxwell           12            38
18  27267   Madison Johnston           20            37
19  19985   Virginia Nichols           13            49

In [57]:
get_last_name = lambda x: x.split()[-1]
get_first_name=lambda y:y.split()[0]

In [63]:
df['last name'] = df.name.apply(get_last_name)
df
df['first name']=df.name.apply(get_first_name)
df

       id               name  hourly_wage  hours_worked  last name first name
0   10310      Lauren Durham           19            43     Durham     Lauren
1   18656      Grace Sellers           17            40    Sellers      Grace
2   61254  Shirley Rasmussen           16            30  Rasmussen    Shirley
3   16886        Brian Rojas           18            47      Rojas      Brian
4   89010    Samantha Mosley           11            38     Mosley   Samantha
5   87246       Louis Guzman           14            39     Guzman      Louis
6   20578     Denise Mcclure           15            40    Mcclure     Denise
7   12869      James Raymond           15            32    Raymond      James
8   53461       Noah Collier           18            35    Collier       Noah
9   14746    Donna Frederick           20            41  Frederick      Donna
10  71127       Shirley Beck           14            32       Beck    Shirley
11  92522    Christina Kelly            8            44      Kelly  Christina
12  22447        Brian Noble           11            39      Noble      Brian
13  61654          Randy Key           16            38        Key      Randy
14  16988      Diana Stewart           14            48    Stewart      Diana
15  68619       Timothy Sosa           14            42       Sosa    Timothy
16  59949      Betty Skinner           11            48    Skinner      Betty
17  81418      Janet Maxwell           12            38    Maxwell      Janet
18  27267   Madison Johnston           20            37   Johnston    Madison
19  19985   Virginia Nichols           13            49    Nichols   Virginia

In [59]:
df.corr()

                    id  hourly_wage  hours_worked
id            1.000000    -0.571575     -0.240365
hourly_wage  -0.571575     1.000000     -0.192005
hours_worked -0.240365    -0.192005      1.000000

In [61]:
df.hourly_wage.corr(df.hours_worked)

-0.19200474116230667

In [66]:
print("unique entries in first name ",df['first name'].unique())
print("no of unique entries in first name ",df['first name'].nunique())

unique entries in first name  ['Lauren' 'Grace' 'Shirley' 'Brian' 'Samantha' 'Louis' 'Denise' 'James'
 'Noah' 'Donna' 'Christina' 'Randy' 'Diana' 'Timothy' 'Betty' 'Janet'
 'Madison' 'Virginia']
no of unique entries in first name  18